testing/jmeter_test_aggregate_report.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
GET /api/users/{id},129907,1,0,1,3,15,0,299,0.000%,34.75583,11.11,4.31
GET /api/users,129710,1,0,2,3,18,0,226,0.000%,34.70892,27.22,4.24
GET /api/accounts/{id},129604,1,0,1,3,16,0,236,0.000%,34.68612,10.08,4.41
GET /api/accounts,129451,1,1,2,3,17,0,237,0.000%,34.64998,22.01,4.33
POST /api/transactions - TRANSFER,129291,1,1,2,3,17,0,208,0.000%,34.61208,17.50,10.75
POST /api/transactions - WITHDRAW,129184,1,1,2,3,18,0,200,0.000%,34.58838,17.46,10.03
POST /api/transactions - DEPOSIT,129053,1,1,2,3,15,0,200,0.000%,34.55801,17.57,10.02
PUT /api/transactions/{id},128895,1,0,1,3,16,0,199,0.000%,34.52038,16.36,7.67
GET /api/transactions/{id},128784,0,0,1,2,15,0,175,0.000%,34.49527,15.94,4.53
GET /api/transactions,128641,10,8,19,26,57,0,324,0.000%,34.46263,51.03,4.44
TOTAL,1292520,2,1,5,11,27,0,324,0.000%,345.80587,206.13,64.69